{"config": {"name": "model", "layers": [{"config": {"batch_input_shape": [null, 84, 84, 4], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "name": "layer1", "dilation_rate": [1, 1], "activity_regularizer": null, "dtype": "float32", "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [9, 9], "filters": 32, "trainable": true, "strides": [4, 4], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"minval": -0.05, "dtype": "float32", "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "padding": "same"}, "name": "layer1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "activation", "activation": "relu", "trainable": true}, "name": "activation", "class_name": "Activation", "inbound_nodes": [[["layer1", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "name": "layer2", "dilation_rate": [1, 1], "activity_regularizer": null, "dtype": "float32", "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 64, "trainable": true, "strides": [2, 2], "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"minval": -0.05, "dtype": "float32", "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "padding": "same"}, "name": "layer2", "class_name": "Conv2D", "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "activation_1", "activation": "relu", "trainable": true}, "name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["layer2", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "name": "flatten", "dtype": "float32", "trainable": true}, "name": "flatten", "class_name": "Flatten", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "name": "dense_layer1", "activation": "linear", "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"minval": -0.05, "dtype": "float32", "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "units": 512}, "name": "dense_layer1", "class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "activation_2", "activation": "relu", "trainable": true}, "name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["dense_layer1", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "name": "dense_layer2", "activation": "linear", "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"minval": -0.05, "dtype": "float32", "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "units": 6}, "name": "dense_layer2", "class_name": "Dense", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_layer2", 0, 0]]}, "class_name": "Model", "keras_version": "2.2.4-tf", "backend": "tensorflow"}